micropython/micropython/ports/psoc-edge/machine_pdm_pcm.c
/*========================================================================================================================*/
// PDM_PCM higher level MPY functions (extmod/machine_pdm_pcm.c)

static void machine_pdm_pcm_print(const mp_print_t *print, mp_obj_t self_in, mp_print_kind_t kind) {
    machine_pdm_pcm_obj_t *self = MP_OBJ_TO_PTR(self_in);
    mp_printf(print,
        "PDM_PCM(id=%u,\n"
        "sample_rate=%ld,\n"
        "decimation_rate=%d,\n"
        "bits=%u,\n"
        "format=%u,\n"
        "left_gain=%d,\n"
        "right_gain=%d)",
        self->pdm_pcm_id,
        self->sample_rate,
        self->decimation_rate,
        self->bits,
        self->format,
        self->left_gain,
        self->right_gain
        );
}

// PDM_PCM.init(...)
static mp_obj_t machine_pdm_pcm_init(mp_obj_t self_in) {
    mplogger_print("machine_pdm_pcm_init \r\n");
    machine_pdm_pcm_obj_t *self = MP_OBJ_TO_PTR(self_in);
    mp_machine_pdm_pcm_init(self);
    return mp_const_none;
}
static MP_DEFINE_CONST_FUN_OBJ_1(machine_pdm_pcm_init_obj, machine_pdm_pcm_init);

// PDM_PCM.deinit()
static mp_obj_t machine_pdm_pcm_deinit(mp_obj_t self_in) {
    mplogger_print("machine_pdm_pcm_deinit \r\n");
    machine_pdm_pcm_obj_t *self = MP_OBJ_TO_PTR(self_in);
    mp_machine_pdm_pcm_deinit(self);
    return mp_const_none;
}
static MP_DEFINE_CONST_FUN_OBJ_1(machine_pdm_pcm_deinit_obj, machine_pdm_pcm_deinit);

// PDM_PCM.set_gain()
static mp_obj_t machine_pdm_pcm_set_gain(size_t n_args, const mp_obj_t *pos_args, mp_map_t *kw_args) {
    mplogger_print("machine_pdm_pcm_set_gain \r\n");

    enum { ARG_left_gain, ARG_right_gain};
    static const mp_arg_t allowed_args[] = {
        { MP_QSTR_left_gain,       MP_ARG_KW_ONLY | MP_ARG_INT,   {.u_int = DEFAULT_LEFT_GAIN} },
        { MP_QSTR_right_gain,      MP_ARG_KW_ONLY | MP_ARG_INT,   {.u_int = DEFAULT_RIGHT_GAIN} }
    };

    mp_arg_val_t args[MP_ARRAY_SIZE(allowed_args)];
    mp_arg_parse_all(n_args - 1, pos_args + 1, kw_args, MP_ARRAY_SIZE(allowed_args), allowed_args, args);
    machine_pdm_pcm_obj_t *self = MP_OBJ_TO_PTR(pos_args[0]);

    self->left_gain = args[ARG_left_gain].u_int;
    self->right_gain = args[ARG_right_gain].u_int;

    mp_machine_pdm_pcm_set_gain(self, self->left_gain, self->right_gain);
    return mp_const_none;
}
static MP_DEFINE_CONST_FUN_OBJ_KW(machine_pdm_pcm_set_gain_obj, 1, machine_pdm_pcm_set_gain);

// PDM_PCM.irq(handler)
static mp_obj_t machine_pdm_pcm_irq(mp_obj_t self_in, mp_obj_t handler) {
    mplogger_print("machine_pdm_pcm_irq \r\n");
    return mp_const_none;
}
static MP_DEFINE_CONST_FUN_OBJ_2(machine_pdm_pcm_irq_obj, machine_pdm_pcm_irq);


cy_en_pdm_pcm_ch_fir1_decimcode_t pdm_pcm_convert_decim_rate(uint8_t decim_rate) {
    cy_en_pdm_pcm_ch_fir1_decimcode_t pdl_code = CY_PDM_PCM_CHAN_FIR1_DECIM_1;

    switch (decim_rate)
    {
        case 32:
            pdl_code = CY_PDM_PCM_CHAN_FIR1_DECIM_1;
            break;
        case 64:
            pdl_code = CY_PDM_PCM_CHAN_FIR1_DECIM_2;
            break;
        case 96:
            pdl_code = CY_PDM_PCM_CHAN_FIR1_DECIM_3;
            break;
        case 128:
            pdl_code = CY_PDM_PCM_CHAN_FIR1_DECIM_4;
            break;
        default:
            break;
    }

    return pdl_code;
}

// IRQ Handler
static void pdm_pcm_irq_handler(void) {

}

// Helper: Configure PDM PCM interrupts
static void pdm_pcm_configure_interrupts(format_t format) {
    mplogger_print("pdm_pcm_configure_interrupts \r\n");
    if ((format == MONO_LEFT) || (format == STEREO)) {
        Cy_PDM_PCM_Channel_ClearInterrupt(PDM0, LEFT_CH_INDEX, CY_PDM_PCM_INTR_MASK);
        Cy_PDM_PCM_Channel_SetInterruptMask(PDM0, LEFT_CH_INDEX, CY_PDM_PCM_INTR_MASK);
    }
    if ((format == MONO_RIGHT) || (format == STEREO)) {
        Cy_PDM_PCM_Channel_ClearInterrupt(PDM0, RIGHT_CH_INDEX, CY_PDM_PCM_INTR_MASK);
        Cy_PDM_PCM_Channel_SetInterruptMask(PDM0, RIGHT_CH_INDEX, CY_PDM_PCM_INTR_MASK);
    }
    /* Register the IRQ handler */
    if (CY_SYSINT_SUCCESS != Cy_SysInt_Init(&PDM_IRQ_cfg, &pdm_pcm_irq_handler)) {
        printf("PDM PCM Initialization has failed! \r\n");
        CY_ASSERT(0);
    }
    NVIC_ClearPendingIRQ(PDM_IRQ_cfg.intrSrc);
    NVIC_EnableIRQ(PDM_IRQ_cfg.intrSrc);
}

// Helper: Configure DPLL for audio clock generation
static cy_rslt_t dpll_lp_configure(uint32_t target_freq) {
    mplogger_print("dpll_lp_configure \r\n");
    cy_rslt_t result;

    /* Check if the current DPLL_LP_1 frequency is already set to target */
    uint32_t current_freq = Cy_SysClk_PllGetFrequency(SRSS_DPLL_LP_1_PATH_NUM);
    if (current_freq == target_freq) {
        mplogger_print("DPLL_LP_1 already at target frequency\r\n");
        return CY_RSLT_SUCCESS;
    }

    /* Configure DPLL_LP_1 PLL */
    cy_stc_pll_config_t dpll_config = {
        .inputFreq = DPLL_INPUT_FREQ_HZ,
        .outputFreq = target_freq,
        .outputMode = CY_SYSCLK_FLLPLL_OUTPUT_AUTO,
        .lfMode = false,
    };

    /* Disable the DPLL_LP_1 PLL path */
    Cy_SysClk_PllDisable(SRSS_DPLL_LP_1_PATH_NUM);

    /* Configure the PLL with the specified settings */
    result = Cy_SysClk_PllConfigure(SRSS_DPLL_LP_1_PATH_NUM, &dpll_config);
    if (result != CY_SYSCLK_SUCCESS) {
        mp_raise_msg_varg(&mp_type_ValueError,
            MP_ERROR_TEXT("DPLL LP1 configuration failed with return code %lx"),
            result);
    }

    /* Enable the DPLL_LP_1 PLL path with a timeout */
    result = Cy_SysClk_PllEnable(SRSS_DPLL_LP_1_PATH_NUM, DPLL_ENABLE_TIMEOUT_MS);
    if (result != CY_SYSCLK_SUCCESS) {
        mp_raise_msg_varg(&mp_type_ValueError,
            MP_ERROR_TEXT("DPLL LP1 enable failed with return code %lx"),
            result);
    }

    return CY_RSLT_SUCCESS;
}

// Helper: Determine appropriate DPLL frequency for sample rate
static uint32_t pdm_pcm_get_dpll_freq(uint32_t sample_rate) {
    mplogger_print("pdm_pcm_get_dpll_freq \r\n");
    switch (sample_rate) {
        case SAMPLE_RATE_8000:
        case SAMPLE_RATE_16000:
        case SAMPLE_RATE_48000:
            return DPLL_OUTPUT1_FREQ_HZ;

        case SAMPLE_RATE_22050:
        case SAMPLE_RATE_44100:
            return DPLL_OUTPUT2_FREQ_HZ;

        default:
            return 0;  // Invalid sample rate
    }
}

// Helper: Calculate optimal clock divider with rounding
static uint16_t pdm_pcm_calculate_clk_div(uint32_t dpll_freq, uint32_t sample_rate, uint8_t decimation_rate) {
    mplogger_print("pdm_pcm_calculate_clk_div \r\n");
    uint32_t required_clk = sample_rate * decimation_rate * PDM_PCM_CLK_OVERSAMPLING_FACTOR;

