micropython/micropython/ports/psoc-edge/machine_pdm_pcm.c
    /* Calculate divider with rounding for better accuracy */
    uint16_t clk_div = (dpll_freq + (required_clk / 2)) / required_clk;

    /* Ensure divider is at least 1 */
    return (clk_div > 0) ? clk_div : 1;
}

// Helper: Configure peripheral clock divider
static void pdm_pcm_configure_clock_divider(uint16_t clk_div) {
    mplogger_print("pdm_pcm_configure_clock_divider \r\n");
    /* Disable the clock divider before reconfiguration */
    Cy_SysClk_PeriPclkDisableDivider((en_clk_dst_t)CYBSP_PDM_CLK_DIV_GRP_NUM,
        CY_SYSCLK_DIV_16_5_BIT, 1U);

    /* Set the fractional divider (integer part only, fractional part = 0) */
    Cy_SysClk_PeriPclkSetFracDivider((en_clk_dst_t)CYBSP_PDM_CLK_DIV_GRP_NUM,
        CY_SYSCLK_DIV_16_5_BIT, 1U, clk_div, 0U);

    /* Enable the configured clock divider */
    Cy_SysClk_PeriPclkEnableDivider((en_clk_dst_t)CYBSP_PDM_CLK_DIV_GRP_NUM,
        CY_SYSCLK_DIV_16_5_BIT, 1U);
}

// Initialize PDM PCM sample rate and clock configuration
static PDM_PCM_STATUS_t pdm_pcm_init_sample_rate(uint32_t sample_rate, uint8_t decimation_rate) {
    mplogger_print("pdm_pcm_init_sample_rate \r\n");
    /* Determine the appropriate DPLL frequency for the sample rate */
    uint32_t dpll_freq = pdm_pcm_get_dpll_freq(sample_rate);
    if (dpll_freq == 0) {
        mp_raise_ValueError(MP_ERROR_TEXT("Unsupported sample rate"));
        return PDM_PCM_STATUS_BAD_PARAM;
    }

    /* Configure DPLL to the required frequency */
    dpll_lp_configure(dpll_freq);

    /* Calculate optimal clock divider */
    uint16_t clk_div = pdm_pcm_calculate_clk_div(dpll_freq, sample_rate, decimation_rate);

    /* Configure the peripheral clock divider */
    pdm_pcm_configure_clock_divider(clk_div);

    mplogger_print("PDM PCM clock configured: DPLL=%lu Hz, div=%u\r\n", dpll_freq, clk_div);

    return PDM_PCM_STATUS_SUCCESS;
}

// Init hardware block
static void pdm_pcm_init(machine_pdm_pcm_obj_t *self) {
    cy_rslt_t result;
    mplogger_print("pdm_pcm_init \r\n");

    // Configure PDM PCM block
    cy_stc_pdm_pcm_config_v2_t PDM_config = {
        .clkDiv = 7,
        .clksel = CY_PDM_PCM_SEL_SRSS_CLOCK,
        .halverate = CY_PDM_PCM_RATE_FULL,
        .route = 4,
        .fir0_coeff_user_value = false,
        .fir1_coeff_user_value = false,
    };

    // Initialize PDM PCM block
    result = Cy_PDM_PCM_Init(PDM0, &PDM_config);
    pdm_pcm_assert_raise_val("PDM_PCM initialisation failed with return code %lx !", result);
    pdm_pcm_init_sample_rate(self->sample_rate, self->decimation_rate);
    // Initialize left channel if needed
    if ((self->format == MONO_LEFT) || (self->format == STEREO)) {
        Cy_PDM_PCM_Channel_Enable(PDM0, LEFT_CH_INDEX);
        result = Cy_PDM_PCM_Channel_Init(PDM0, &channel_config, LEFT_CH_INDEX);
        Cy_PDM_PCM_SetGain(PDM0, LEFT_CH_INDEX, self->left_gain);
    }

    // Initialize right channel if needed
    if ((self->format == MONO_RIGHT) || (self->format == STEREO)) {
        channel_config.sampledelay = 5;
        Cy_PDM_PCM_Channel_Enable(PDM0, RIGHT_CH_INDEX);
        result = Cy_PDM_PCM_Channel_Init(PDM0, &channel_config, RIGHT_CH_INDEX);
        Cy_PDM_PCM_SetGain(PDM0, RIGHT_CH_INDEX, self->right_gain);
    }
    pdm_pcm_configure_interrupts(self->format);
}

int8_t get_frame_mapping_index(int8_t bits, format_t format) {
    if ((format == MONO_LEFT) | (format == MONO_RIGHT)) {
        if (bits == 16) {
            return 0;
        }
    } else { // STEREO
        if (bits == 16) {
            return 2;
        }
    }
    return -1;
}

// First read RX buffer
static void pdm_pcm_read_rxbuf(machine_pdm_pcm_obj_t *self) {

}

// First read and start the hw block
static void pdm_pcm_rx_init(machine_pdm_pcm_obj_t *self) {

}

// =======================================================================================
// MPY bindings for PDM_PCM

MP_NOINLINE static void machine_pdm_pcm_init_helper(machine_pdm_pcm_obj_t *self, size_t n_pos_args, const mp_obj_t *pos_args, mp_map_t *kw_args) {
    mplogger_print("machine_pdm_pcm_init_helper \r\n");
    static const mp_arg_t allowed_args[] = {
        { MP_QSTR_sample_rate,     MP_ARG_KW_ONLY | MP_ARG_INT,   {.u_int = 16000} },
        { MP_QSTR_decimation_rate, MP_ARG_KW_ONLY | MP_ARG_INT,   {.u_int = 96} },
        { MP_QSTR_bits,            MP_ARG_KW_ONLY | MP_ARG_INT,   {.u_int = 16} },
        { MP_QSTR_format,          MP_ARG_KW_ONLY | MP_ARG_INT,   {.u_int = MONO_LEFT} },
        { MP_QSTR_left_gain,       MP_ARG_KW_ONLY | MP_ARG_INT,   {.u_int = DEFAULT_LEFT_GAIN} },
        { MP_QSTR_right_gain,      MP_ARG_KW_ONLY | MP_ARG_INT,   {.u_int = DEFAULT_RIGHT_GAIN} },
    };

    mp_arg_val_t args[MP_ARRAY_SIZE(allowed_args)];
    mp_arg_parse_all(n_pos_args, pos_args, kw_args, MP_ARRAY_SIZE(allowed_args), allowed_args, args);
    mp_machine_pdm_pcm_init_helper(self, args);
}

// PDM_PCM(...) Constructor
static mp_obj_t machine_pdm_pcm_make_new(const mp_obj_type_t *type, size_t n_pos_args, size_t n_kw_args, const mp_obj_t *args) {
    mplogger_print("machine_pdm_pcm_make_new \r\n");
    mp_arg_check_num(n_pos_args, n_kw_args, 1, MP_OBJ_FUN_ARGS_MAX, true);
    mp_int_t pdm_pcm_id = mp_obj_get_int(args[0]);

    machine_pdm_pcm_obj_t *self = mp_machine_pdm_pcm_make_new_instance(pdm_pcm_id);

    mp_map_t kw_args;
    mp_map_init_fixed_table(&kw_args, n_kw_args, args + n_pos_args);
    machine_pdm_pcm_init_helper(self, n_pos_args - 1, args + 1, &kw_args);

    return MP_OBJ_FROM_PTR(self);
}

// constructor()
static machine_pdm_pcm_obj_t *mp_machine_pdm_pcm_make_new_instance(mp_int_t pdm_pcm_id) {
    mplogger_print("mp_machine_pdm_pcm_make_new_instance \r\n");
    (void)pdm_pcm_id;
    machine_pdm_pcm_obj_t *self = NULL;
    for (uint8_t i = 0; i < MICROPY_HW_MAX_PDM_PCM; i++) {
        if (MP_STATE_PORT(machine_pdm_pcm_obj[i]) == NULL) {
            self = mp_obj_malloc(machine_pdm_pcm_obj_t, &machine_pdm_pcm_type);
            MP_STATE_PORT(machine_pdm_pcm_obj[i]) = self;
            self->pdm_pcm_id = i;
            break;
        }
    }
    if (self == NULL) {
        mp_raise_ValueError(MP_ERROR_TEXT("all available pdm pcm instances are allocated"));
    }
    return self;
}

